BuiTienDngg/buck_boost_synchronous_converter_stm32/Firmware_v4/LCD_TFT_ST7735/Inc/UI.h
#ifndef __UI_H
#define __UI_H

#include "stm32f1xx_hal.h"
#include <stdint.h>

typedef enum
{
    BBUI_STATE_OFF = 0,
    BBUI_STATE_CV,
    BBUI_STATE_CC,
    BBUI_STATE_FAULT
} BBUI_State_t;

typedef struct
{
    float vset;
    float iset;
} BBUI_Preset_t;

typedef struct
{
    float vin;
    float vout;
    float current;
    float temp;

    float vset;
    float iset;

    uint8_t enable;
    BBUI_State_t state;

    uint8_t batt_cells;
    uint8_t active_preset;
    uint8_t mqtt_enable;

    BBUI_Preset_t preset[3];
} BBUI_Data_t;
typedef enum
{
    MAIN_VSET = 0,
    MAIN_ISET,
    MAIN_PRESET,
    MAIN_OUT,
    MAIN_COUNT,
		MAIN_OUT_OFF
} UI_MainField_t;

void BBUI_Init(BBUI_Data_t *data, TIM_HandleTypeDef *htim_encoder);
void BBUI_Task(void);
void BBUI_ButtonIRQ(void);
void BBUI_ForceRefresh(void);

void BBUI_LoadFromFlash(void);
void BBUI_SaveToFlash(void);
void handleUI(void);
void BBUI_SolderSetData(float tip_temp,
                        float iron_current,
                        float fet_temp,
                        float power);

float BBUI_SolderGetSetTemp(void);
uint8_t BBUI_IsSolderScreen(void);
#endif